Rb_to_Ra/W6D5/views_99Cats/app/controllers/cats_controller.rb

INSERT INTO "cats" ("name", "birth_date", "color", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "garfield"], ["birth_date", "2000-10-11"], ["color", "orange"], ["created_at", "2021-06-18 23:21:38.891859"], ["updated_at", "2021-06-18 23:21:38.891859"]]
---
    def create
        @cat = Cat.new(cat_params)

        if @cat.save