W6D5/views_99Cats/app/controllers/cats_controller.rb

    def index
        @cats = Cats.all
---
SELECT "cats".* FROM "cats"